const COURSE_INDEX = {
  "上海交通大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "817"
      ]
    },
    {
      "subject": "自动控制理论",
      "codes": [
        "816"
      ]
    }
  ],
  "上海理工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "867"
      ]
    }
  ],
  "东北大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "839"
      ]
    }
  ],
  "东北电力大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "841"
      ]
    }
  ],
  "东南大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "835"
      ]
    }
  ],
  "中北大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "827"
      ]
    }
  ],
  "中南大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "846",
        "895"
      ]
    }
  ],
  "中国民航大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "801"
      ]
    }
  ],
  "中国矿业大学（徐州）": [
    {
      "subject": "自动控制原理",
      "codes": [
        "868"
      ]
    }
  ],
  "中国科学院沈阳自动化研究所": [
    {
      "subject": "自动控制原理",
      "codes": [
        "857"
      ]
    }
  ],
  "中山大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "889"
      ]
    }
  ],
  "兰州理工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "835"
      ]
    }
  ],
  "内蒙古大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "867"
      ]
    }
  ],
  "内蒙古工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "827"
      ]
    }
  ],
  "内蒙古科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "809"
      ]
    }
  ],
  "北京交通大学": [
    {
      "subject": "控制综合",
      "codes": [
        "801"
      ]
    }
  ],
  "北京信息科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "803"
      ]
    }
  ],
  "北京化工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "841"
      ]
    }
  ],
  "北京工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "821"
      ]
    }
  ],
  "北京建筑大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "832"
      ]
    }
  ],
  "北京林业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "855"
      ]
    }
  ],
  "北京科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "851"
      ]
    },
    {
      "subject": "仪器与机械",
      "codes": [
        "813"
      ]
    }
  ],
  "北方工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "851"
      ]
    }
  ],
  "华中科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "829"
      ]
    }
  ],
  "华北理工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "821"
      ]
    }
  ],
  "南京信息工程大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "817"
      ]
    }
  ],
  "南京大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "865"
      ]
    }
  ],
  "南京工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "820"
      ]
    }
  ],
  "南京林业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "834"
      ]
    }
  ],
  "南京航空航天大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "820"
      ]
    }
  ],
  "南京邮电大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "812"
      ]
    }
  ],
  "南开大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "810"
      ]
    },
    {
      "subject": "控制综合",
      "codes": [
        "809"
      ]
    }
  ],
  "厦门大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "844"
      ]
    }
  ],
  "合肥工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "834"
      ]
    }
  ],
  "吉林大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "812"
      ]
    }
  ],
  "同济大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "825"
      ]
    }
  ],
  "哈尔滨工程大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "808"
      ]
    }
  ],
  "哈尔滨理工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "810"
      ]
    }
  ],
  "四川大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "871"
      ]
    }
  ],
  "四川轻化工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "809"
      ]
    }
  ],
  "国防科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "851"
      ]
    }
  ],
  "大连交通大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "807"
      ]
    }
  ],
  "大连海事大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "806"
      ]
    }
  ],
  "大连理工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "854"
      ]
    },
    {
      "subject": "控制工程基础",
      "codes": [
        "821"
      ]
    }
  ],
  "天津工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "811"
      ]
    }
  ],
  "安徽工程大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "811"
      ]
    },
    {
      "subject": "控制工程基础",
      "codes": [
        "836"
      ]
    }
  ],
  "山东大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "847"
      ]
    }
  ],
  "山西大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "865"
      ]
    }
  ],
  "广东工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "810"
      ]
    }
  ],
  "广州大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "864"
      ]
    }
  ],
  "广西科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "803"
      ]
    }
  ],
  "扬州大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "832"
      ]
    }
  ],
  "杭州电子科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "861"
      ]
    }
  ],
  "桂林电子科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "808"
      ]
    }
  ],
  "武汉大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "856"
      ]
    }
  ],
  "武汉理工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "848"
      ]
    },
    {
      "subject": "控制工程基础",
      "codes": [
        "840"
      ]
    }
  ],
  "武汉科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "814"
      ]
    }
  ],
  "江南大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "807"
      ]
    }
  ],
  "江汉大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "807"
      ]
    }
  ],
  "江苏科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "808"
      ]
    }
  ],
  "沈阳工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "827"
      ]
    }
  ],
  "沈阳理工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "811"
      ]
    }
  ],
  "沈阳航空航天大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "809"
      ]
    }
  ],
  "河北科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "802",
        "829"
      ]
    }
  ],
  "河南科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "823"
      ]
    }
  ],
  "济南大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "841"
      ]
    }
  ],
  "海南大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "899"
      ]
    }
  ],
  "深圳大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "901"
      ]
    }
  ],
  "渤海大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "832"
      ]
    }
  ],
  "湖南大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "823"
      ]
    }
  ],
  "湖南科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "822"
      ]
    }
  ],
  "湘潭大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "837"
      ]
    }
  ],
  "燕山大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "805",
        "806",
        "830",
        "832"
      ]
    },
    {
      "subject": "控制工程基础",
      "codes": [
        "802"
      ]
    }
  ],
  "电子科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "839"
      ]
    },
    {
      "subject": "控制工程基础",
      "codes": [
        "862"
      ]
    },
    {
      "subject": "航空宇航与导航制导",
      "codes": [
        "865"
      ]
    }
  ],
  "空军工程大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "881"
      ]
    },
    {
      "subject": "控制工程基础",
      "codes": [
        "803"
      ]
    },
    {
      "subject": "航空宇航与导航制导",
      "codes": [
        "806",
        "835"
      ]
    }
  ],
  "苏州大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "842"
      ]
    }
  ],
  "西北工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "821"
      ]
    }
  ],
  "西安工程大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "813"
      ]
    }
  ],
  "西安建筑科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "836",
        "874"
      ]
    }
  ],
  "西安电子科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "843"
      ]
    }
  ],
  "西安科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "818"
      ]
    }
  ],
  "西安邮电大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "828"
      ]
    }
  ],
  "辽宁石油化工大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "841"
      ]
    }
  ],
  "重庆大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "844"
      ]
    }
  ],
  "重庆邮电大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "805"
      ]
    }
  ],
  "长春工业大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "806"
      ]
    }
  ],
  "陕西科技大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "807"
      ]
    }
  ],
  "黑龙江大学": [
    {
      "subject": "自动控制原理",
      "codes": [
        "830",
        "890"
      ]
    }
  ],
  "上海大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "836"
      ]
    }
  ],
  "东北林业大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "828"
      ]
    }
  ],
  "东华大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "824"
      ]
    }
  ],
  "中国海洋大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "842"
      ]
    }
  ],
  "中国石油大学（北京）": [
    {
      "subject": "自动控制理论",
      "codes": [
        "854"
      ]
    }
  ],
  "中国石油大学（华东）": [
    {
      "subject": "自动控制理论",
      "codes": [
        "829"
      ]
    }
  ],
  "中国科学技术大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "845"
      ]
    }
  ],
  "中国科学院大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "857"
      ]
    }
  ],
  "北京理工大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "810"
      ]
    }
  ],
  "华东交通大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "811"
      ]
    }
  ],
  "华北电力大学（保定）": [
    {
      "subject": "自动控制理论",
      "codes": [
        "841"
      ]
    }
  ],
  "华北电力大学（北京）": [
    {
      "subject": "自动控制理论",
      "codes": [
        "841"
      ]
    }
  ],
  "南京理工大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "873"
      ]
    }
  ],
  "南昌大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "873"
      ]
    }
  ],
  "南通大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "820"
      ]
    }
  ],
  "天津大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "812"
      ]
    }
  ],
  "天津科技大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "819"
      ]
    }
  ],
  "太原理工大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "830"
      ]
    }
  ],
  "太原科技大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "825"
      ]
    }
  ],
  "安徽大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "831"
      ]
    }
  ],
  "新疆大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "842"
      ]
    }
  ],
  "河北大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "887"
      ]
    }
  ],
  "河北工业大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "897"
      ]
    }
  ],
  "河南大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "849",
        "884"
      ]
    }
  ],
  "河海大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "827"
      ]
    }
  ],
  "浙江工业大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "828"
      ]
    }
  ],
  "浙江理工大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "851"
      ]
    }
  ],
  "湖北工业大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "811"
      ]
    },
    {
      "subject": "控制工程基础",
      "codes": [
        "803"
      ]
    }
  ],
  "湖州师范学院": [
    {
      "subject": "自动控制理论",
      "codes": [
        "882"
      ]
    }
  ],
  "福州大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "812"
      ]
    }
  ],
  "西安交通大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "811",
        "871"
      ]
    }
  ],
  "西安工业大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "810"
      ]
    }
  ],
  "西安理工大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "822"
      ]
    }
  ],
  "贵州大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "837"
      ]
    }
  ],
  "辽宁工业大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "810"
      ]
    }
  ],
  "郑州大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "832"
      ]
    }
  ],
  "长安大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "812"
      ]
    }
  ],
  "长沙理工大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "825"
      ]
    }
  ],
  "青岛大学": [
    {
      "subject": "自动控制理论",
      "codes": [
        "825"
      ]
    }
  ],
  "北京邮电大学": [
    {
      "subject": "控制工程基础",
      "codes": [
        "810"
      ]
    }
  ],
  "清华大学": [
    {
      "subject": "控制工程基础",
      "codes": [
        "822"
      ]
    }
  ],
  "华东理工大学": [
    {
      "subject": "控制原理",
      "codes": [
        "816"
      ]
    }
  ],
  "哈尔滨工业大学": [
    {
      "subject": "控制原理",
      "codes": [
        "801"
      ]
    },
    {
      "subject": "航空宇航与导航制导",
      "codes": [
        "807"
      ]
    }
  ],
  "青岛科技大学": [
    {
      "subject": "控制原理",
      "codes": [
        "816"
      ]
    }
  ],
  "北京航空航天大学": [
    {
      "subject": "控制综合",
      "codes": [
        "833"
      ]
    }
  ]
};
