const COURSE_INDEX = {
  "南京大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "851"
      ]
    }
  ],
  "厦门大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "847"
      ]
    },
    {
      "subject": "半导体物理与器件",
      "codes": [
        "877"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "821"
      ]
    }
  ],
  "华南理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "811"
      ]
    }
  ],
  "四川大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "854"
      ]
    }
  ],
  "天津大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "815"
      ]
    },
    {
      "subject": "通信原理",
      "codes": [
        "814"
      ]
    },
    {
      "subject": "半导体物理&器件物理",
      "codes": []
    }
  ],
  "华中科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "824"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "831"
      ]
    }
  ],
  "武汉大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "807"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "879"
      ]
    }
  ],
  "西北工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "827",
        "(27改考)"
      ]
    }
  ],
  "中南大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "853"
      ]
    }
  ],
  "重庆大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "841"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "832"
      ]
    }
  ],
  "国防科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "831"
      ]
    },
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "843"
      ]
    }
  ],
  "大连理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "852"
      ]
    },
    {
      "subject": "模电",
      "codes": [
        "851"
      ]
    }
  ],
  "电子科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "858"
      ]
    },
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "813"
      ]
    },
    {
      "subject": "半导体物理与器件",
      "codes": [
        "832"
      ]
    },
    {
      "subject": "信号、通信原理或自控",
      "codes": []
    }
  ],
  "湖南大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "828"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "822",
        "863"
      ]
    }
  ],
  "中山大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "884"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "885"
      ]
    }
  ],
  "复旦大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "875"
      ]
    },
    {
      "subject": "半导体物理与器件",
      "codes": [
        "882"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "881"
      ]
    }
  ],
  "华东师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "(27改考)"
      ]
    },
    {
      "subject": "数电",
      "codes": [
        "801"
      ]
    },
    {
      "subject": "数电&半导体物理",
      "codes": []
    }
  ],
  "北京邮电大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "804"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "822"
      ]
    },
    {
      "subject": "通信原理",
      "codes": [
        "801"
      ]
    }
  ],
  "西安电子科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "844",
        "892"
      ]
    },
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "822"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "801"
      ]
    },
    {
      "subject": "信号+「电路",
      "codes": [
        "811",
        "821"
      ]
    }
  ],
  "杭州电子科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "843",
        "845"
      ]
    }
  ],
  "西安邮电大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "824"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "823"
      ]
    }
  ],
  "重庆邮电大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "801"
      ]
    },
    {
      "subject": "数电",
      "codes": [
        "808"
      ]
    }
  ],
  "北京工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "822"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "823"
      ]
    }
  ],
  "北京化工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "843"
      ]
    },
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "863"
      ]
    }
  ],
  "东华大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "836"
      ]
    }
  ],
  "福州大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "866"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "843"
      ]
    }
  ],
  "贵州大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "832"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "834"
      ]
    }
  ],
  "哈尔滨工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "810"
      ]
    },
    {
      "subject": "信号+「电路",
      "codes": [
        "815"
      ]
    }
  ],
  "海南大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "838",
        "888"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "878"
      ]
    }
  ],
  "湖南师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "898"
      ]
    },
    {
      "subject": "数电",
      "codes": [
        "858"
      ]
    }
  ],
  "华北电力大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "813",
        "832"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "812",
        "836"
      ]
    }
  ],
  "华南师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "837"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "857"
      ]
    }
  ],
  "华中农业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "876"
      ]
    }
  ],
  "华中师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "838"
      ]
    }
  ],
  "南昌大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "811"
      ]
    }
  ],
  "陕西师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "831"
      ]
    }
  ],
  "上海大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "831"
      ]
    },
    {
      "subject": "数电",
      "codes": [
        "842"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "899"
      ]
    },
    {
      "subject": "信号+「电路",
      "codes": [
        "829"
      ]
    }
  ],
  "苏州大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "839"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "873"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "837"
      ]
    },
    {
      "subject": "数电&半导体物理",
      "codes": []
    }
  ],
  "武汉理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "855"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "823"
      ]
    }
  ],
  "西南大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "844"
      ]
    }
  ],
  "西南交通大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "824"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "861"
      ]
    }
  ],
  "新疆大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "827"
      ]
    }
  ],
  "长安大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "814"
      ]
    }
  ],
  "中国传媒大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "823"
      ]
    }
  ],
  "中国石油大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "830",
        "853"
      ]
    },
    {
      "subject": "通信原理",
      "codes": [
        "836"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "853"
      ]
    }
  ],
  "南京信息工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "811"
      ]
    }
  ],
  "宁波大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "829"
      ]
    }
  ],
  "成都理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "826"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "845"
      ]
    }
  ],
  "山西大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "841"
      ]
    }
  ],
  "天津工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "812"
      ]
    },
    {
      "subject": "通信原理",
      "codes": [
        "814"
      ]
    }
  ],
  "中国科学院大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "859"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "804"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "856"
      ]
    },
    {
      "subject": "信号&电路&模电&&数电&通信原理",
      "codes": []
    }
  ],
  "湘潭大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "835"
      ]
    },
    {
      "subject": "模电",
      "codes": [
        "822"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "836"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "834"
      ]
    }
  ],
  "上海科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "882"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "861"
      ]
    }
  ],
  "华南农业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "877"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "821"
      ]
    }
  ],
  "安徽工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "813"
      ]
    }
  ],
  "安徽农业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "859"
      ]
    }
  ],
  "北京电子科技学院": [
    {
      "subject": "信号与系统",
      "codes": [
        "831"
      ]
    }
  ],
  "北京信息科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "802"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "802"
      ]
    }
  ],
  "成都信息工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "803"
      ]
    }
  ],
  "大连交通大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "806"
      ]
    }
  ],
  "东北电力大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "832"
      ]
    }
  ],
  "东北石油大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "818",
        "823"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "817"
      ]
    }
  ],
  "广东工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "809"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "849"
      ]
    }
  ],
  "广西科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "809"
      ]
    }
  ],
  "广州大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "823"
      ]
    }
  ],
  "哈尔滨理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "813"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "809",
        "812"
      ]
    }
  ],
  "海军工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "818"
      ]
    }
  ],
  "河北工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "807"
      ]
    }
  ],
  "河北科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "822"
      ]
    }
  ],
  "河南工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "827"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "856"
      ]
    }
  ],
  "河南理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "865"
      ]
    }
  ],
  "黑龙江大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "888"
      ]
    },
    {
      "subject": "数电",
      "codes": [
        "829",
        "876"
      ]
    }
  ],
  "黑龙江科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "816"
      ]
    }
  ],
  "湖北大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "813"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "824"
      ]
    }
  ],
  "湖北工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "823"
      ]
    },
    {
      "subject": "数电",
      "codes": [
        "847"
      ]
    }
  ],
  "华北理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "816"
      ]
    }
  ],
  "华东交通大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "816"
      ]
    }
  ],
  "华侨大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "823"
      ]
    }
  ],
  "火箭军工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "843"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "821"
      ]
    }
  ],
  "吉首大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "826"
      ]
    }
  ],
  "集美大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "823"
      ]
    }
  ],
  "济南大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "844"
      ]
    }
  ],
  "江西理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "812"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "861"
      ]
    }
  ],
  "江西师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "887"
      ]
    }
  ],
  "昆明理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "817"
      ]
    }
  ],
  "鲁东大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "855"
      ]
    }
  ],
  "内蒙古工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "809"
      ]
    }
  ],
  "内蒙古科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "808"
      ]
    }
  ],
  "内蒙古师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "830"
      ]
    }
  ],
  "青岛科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "852"
      ]
    }
  ],
  "青岛理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "812"
      ]
    }
  ],
  "三峡大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "837"
      ]
    }
  ],
  "山东农业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "809"
      ]
    }
  ],
  "山东师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "850"
      ]
    }
  ],
  "上海海事大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "806"
      ]
    }
  ],
  "上海理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "871"
      ]
    }
  ],
  "上海师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "874"
      ]
    }
  ],
  "沈阳工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "807"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "805"
      ]
    }
  ],
  "沈阳航空航天大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "808"
      ]
    }
  ],
  "沈阳理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "810"
      ]
    }
  ],
  "石家庄铁道大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "894"
      ]
    }
  ],
  "太原科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "826"
      ]
    }
  ],
  "天津科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "822"
      ]
    }
  ],
  "天津理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "822"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "821"
      ]
    }
  ],
  "天津师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "804"
      ]
    }
  ],
  "潍坊学院": [
    {
      "subject": "信号与系统",
      "codes": [
        "801"
      ]
    }
  ],
  "武汉工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "834"
      ]
    }
  ],
  "武汉科技大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "813"
      ]
    }
  ],
  "武汉轻工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "808"
      ]
    }
  ],
  "西安工程大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "812"
      ]
    },
    {
      "subject": "半导体物理与器件",
      "codes": [
        "844"
      ]
    }
  ],
  "西安工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "811"
      ]
    }
  ],
  "西安理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "810",
        "845"
      ]
    },
    {
      "subject": "模电",
      "codes": [
        "820"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "818"
      ]
    }
  ],
  "西安石油大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "810"
      ]
    }
  ],
  "西北师范大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "844"
      ]
    }
  ],
  "西南民族大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "824"
      ]
    }
  ],
  "燕山大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "808"
      ]
    },
    {
      "subject": "电路&模电",
      "codes": []
    }
  ],
  "中原工学院": [
    {
      "subject": "信号与系统",
      "codes": [
        "819"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "808"
      ]
    }
  ],
  "云南民族大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "818"
      ]
    }
  ],
  "长春工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "807"
      ]
    }
  ],
  "长春理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "808"
      ]
    },
    {
      "subject": "模电",
      "codes": [
        "806"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "807"
      ]
    }
  ],
  "长沙理工大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "822",
        "832"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "839"
      ]
    }
  ],
  "浙江工商大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "822"
      ]
    }
  ],
  "中北大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "808"
      ]
    },
    {
      "subject": "半导体物理与器件",
      "codes": [
        "809"
      ]
    }
  ],
  "中国计量大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "805"
      ]
    },
    {
      "subject": "数电",
      "codes": [
        "831"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "808"
      ]
    }
  ],
  "中国民航大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "806"
      ]
    }
  ],
  "中南民族大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "833",
        "856"
      ]
    }
  ],
  "北方工业大学": [
    {
      "subject": "信号与系统",
      "codes": [
        "871"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "872"
      ]
    }
  ],
  "东南大学": [
    {
      "subject": "数字信号处理",
      "codes": [
        "837"
      ]
    },
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "821"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "828"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "820"
      ]
    }
  ],
  "西安交通大学": [
    {
      "subject": "数字信号处理",
      "codes": [
        "850",
        "874"
      ]
    },
    {
      "subject": "半导体物理与器件",
      "codes": [
        "849"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "868"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "815",
        "869"
      ]
    }
  ],
  "北京大学": [
    {
      "subject": "数电",
      "codes": [
        "804"
      ]
    },
    {
      "subject": "数电&模电&电路",
      "codes": []
    },
    {
      "subject": "数电&模电&半导体物理",
      "codes": []
    }
  ],
  "东北大学": [
    {
      "subject": "数电",
      "codes": [
        "840"
      ]
    },
    {
      "subject": "信号+「通信原理",
      "codes": [
        "841"
      ]
    }
  ],
  "山东大学": [
    {
      "subject": "数电",
      "codes": [
        "824"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "830"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "833"
      ]
    }
  ],
  "中国海洋大学": [
    {
      "subject": "数电",
      "codes": [
        "810"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "819"
      ]
    },
    {
      "subject": "半导体物理&器件物理",
      "codes": []
    }
  ],
  "东北农业大学": [
    {
      "subject": "数电",
      "codes": [
        "822"
      ]
    }
  ],
  "太原理工大学": [
    {
      "subject": "数电",
      "codes": [
        "881"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "829"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "801"
      ]
    }
  ],
  "中国地质大学": [
    {
      "subject": "数电",
      "codes": [
        "860"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "852"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "845"
      ]
    },
    {
      "subject": "信号+「电路",
      "codes": [
        "894"
      ]
    }
  ],
  "西南石油大学": [
    {
      "subject": "数电",
      "codes": [
        "816",
        "817"
      ]
    }
  ],
  "安徽科技学院": [
    {
      "subject": "数电",
      "codes": [
        "805"
      ]
    }
  ],
  "安徽师范大学": [
    {
      "subject": "数电",
      "codes": [
        "802"
      ]
    }
  ],
  "大连工业大学": [
    {
      "subject": "数电",
      "codes": [
        "818"
      ]
    }
  ],
  "东华理工大学": [
    {
      "subject": "数电",
      "codes": [
        "804"
      ]
    }
  ],
  "合肥大学": [
    {
      "subject": "数电",
      "codes": [
        "804"
      ]
    }
  ],
  "四川师范大学": [
    {
      "subject": "数电",
      "codes": [
        "832"
      ]
    }
  ],
  "江苏师范大学": [
    {
      "subject": "数电",
      "codes": [
        "850"
      ]
    }
  ],
  "信阳师范大学": [
    {
      "subject": "数电",
      "codes": [
        "841"
      ]
    }
  ],
  "聊城大学": [
    {
      "subject": "数电",
      "codes": [
        "816"
      ]
    },
    {
      "subject": "通信原理",
      "codes": [
        "837"
      ]
    }
  ],
  "衡阳师范学院": [
    {
      "subject": "数电",
      "codes": [
        "831"
      ]
    }
  ],
  "长江大学": [
    {
      "subject": "数电",
      "codes": [
        "835"
      ]
    }
  ],
  "南昌航空大学": [
    {
      "subject": "数电",
      "codes": [
        "841"
      ]
    }
  ],
  "浙江海洋大学": [
    {
      "subject": "数电",
      "codes": [
        "809"
      ]
    }
  ],
  "南通大学": [
    {
      "subject": "数电",
      "codes": [
        "818"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "819"
      ]
    }
  ],
  "湖北汽车工业学院": [
    {
      "subject": "数电",
      "codes": [
        "802"
      ]
    }
  ],
  "沈阳化工大学": [
    {
      "subject": "数电",
      "codes": [
        "815"
      ]
    }
  ],
  "四川轻化工大学": [
    {
      "subject": "数电",
      "codes": [
        "810"
      ]
    },
    {
      "subject": "电路原理",
      "codes": [
        "811"
      ]
    }
  ],
  "吉林大学": [
    {
      "subject": "模电",
      "codes": [
        "(27改考)"
      ]
    },
    {
      "subject": "电路&模电",
      "codes": []
    }
  ],
  "南京航空航天大学": [
    {
      "subject": "模电",
      "codes": [
        "833"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "821"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "878"
      ]
    },
    {
      "subject": "数电&模电&电路",
      "codes": []
    }
  ],
  "北京科技大学": [
    {
      "subject": "模电",
      "codes": [
        "850"
      ]
    },
    {
      "subject": "通信原理",
      "codes": [
        "820"
      ]
    }
  ],
  "暨南大学": [
    {
      "subject": "模电",
      "codes": [
        "823"
      ]
    }
  ],
  "河南大学": [
    {
      "subject": "模电",
      "codes": [
        "847"
      ]
    }
  ],
  "安徽建筑大学": [
    {
      "subject": "模电",
      "codes": [
        "808"
      ]
    }
  ],
  "北华航天工业学院": [
    {
      "subject": "模电",
      "codes": [
        "802"
      ]
    }
  ],
  "吉林师范大学": [
    {
      "subject": "模电",
      "codes": [
        "836"
      ]
    }
  ],
  "南京邮电大学": [
    {
      "subject": "电路原理",
      "codes": [
        "813"
      ]
    },
    {
      "subject": "通信原理",
      "codes": [
        "801"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "820"
      ]
    }
  ],
  "南京农业大学": [
    {
      "subject": "电路原理",
      "codes": [
        "829"
      ]
    }
  ],
  "四川农业大学": [
    {
      "subject": "电路原理",
      "codes": [
        "865"
      ]
    }
  ],
  "南京林业大学": [
    {
      "subject": "电路原理",
      "codes": [
        "882"
      ]
    }
  ],
  "安徽工业大学": [
    {
      "subject": "电路原理",
      "codes": [
        "840"
      ]
    }
  ],
  "安徽理工大学": [
    {
      "subject": "电路原理",
      "codes": [
        "812"
      ]
    }
  ],
  "湖南科技大学": [
    {
      "subject": "电路原理",
      "codes": [
        "823"
      ]
    }
  ],
  "苏州科技大学": [
    {
      "subject": "电路原理",
      "codes": [
        "818"
      ]
    }
  ],
  "江苏海洋大学": [
    {
      "subject": "电路原理",
      "codes": [
        "851"
      ]
    }
  ],
  "武汉纺织大学": [
    {
      "subject": "电路原理",
      "codes": [
        "817"
      ]
    }
  ],
  "常州大学": [
    {
      "subject": "电路原理",
      "codes": [
        "873"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "854"
      ]
    }
  ],
  "江苏科技大学": [
    {
      "subject": "电路原理",
      "codes": [
        "811"
      ]
    }
  ],
  "西华大学": [
    {
      "subject": "电路原理",
      "codes": [
        "821"
      ]
    }
  ],
  "东莞理工学院": [
    {
      "subject": "电路原理",
      "codes": [
        "806"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "812",
        "813"
      ]
    }
  ],
  "河北农业大学": [
    {
      "subject": "电路原理",
      "codes": [
        "818"
      ]
    }
  ],
  "金陵科技学院": [
    {
      "subject": "电路原理",
      "codes": [
        "801"
      ]
    }
  ],
  "中南林业科技大学": [
    {
      "subject": "电路原理",
      "codes": [
        "813"
      ]
    }
  ],
  "河南师范大学": [
    {
      "subject": "电路原理",
      "codes": [
        "809"
      ]
    }
  ],
  "齐鲁工业大学": [
    {
      "subject": "电路原理",
      "codes": [
        "881"
      ]
    }
  ],
  "重庆科技大学": [
    {
      "subject": "电路原理",
      "codes": [
        "819"
      ]
    }
  ],
  "同济大学": [
    {
      "subject": "通信原理",
      "codes": [
        "824"
      ]
    },
    {
      "subject": "数电&Vrilog&电路",
      "codes": []
    }
  ],
  "北京交通大学": [
    {
      "subject": "通信原理",
      "codes": [
        "891"
      ]
    }
  ],
  "河北工业大学": [
    {
      "subject": "通信原理",
      "codes": [
        "891"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "890"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "892"
      ]
    }
  ],
  "河北大学": [
    {
      "subject": "通信原理",
      "codes": [
        "860"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "820"
      ]
    }
  ],
  "江苏大学": [
    {
      "subject": "通信原理",
      "codes": [
        "852"
      ]
    }
  ],
  "兰州交通大学": [
    {
      "subject": "通信原理",
      "codes": [
        "827"
      ]
    }
  ],
  "兰州理工大学": [
    {
      "subject": "通信原理",
      "codes": [
        "839"
      ]
    }
  ],
  "辽宁工程技术大学": [
    {
      "subject": "通信原理",
      "codes": [
        "809"
      ]
    }
  ],
  "西安科技大学": [
    {
      "subject": "通信原理",
      "codes": [
        "821"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "820"
      ]
    }
  ],
  "南开大学": [
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "806"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "808"
      ]
    },
    {
      "subject": "信号+「通信原理",
      "codes": [
        "807"
      ]
    }
  ],
  "中央民族大学": [
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "855",
        "(27改考)"
      ]
    }
  ],
  "南京理工大学": [
    {
      "subject": "电磁场与电磁波",
      "codes": [
        "821"
      ]
    },
    {
      "subject": "半导体物理",
      "codes": [
        "(27改考)"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "818"
      ]
    }
  ],
  "浙江大学": [
    {
      "subject": "半导体物理",
      "codes": [
        "879"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "842",
        "844",
        "873"
      ]
    }
  ],
  "中国科学技术大学": [
    {
      "subject": "半导体物理",
      "codes": [
        "879"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "843"
      ]
    },
    {
      "subject": "数电&模电&电路",
      "codes": []
    }
  ],
  "合肥工业大学": [
    {
      "subject": "半导体物理",
      "codes": [
        "868"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "833",
        "856"
      ]
    },
    {
      "subject": "数电&模电&电路",
      "codes": []
    }
  ],
  "安徽大学": [
    {
      "subject": "半导体物理",
      "codes": [
        "843"
      ]
    },
    {
      "subject": "数模电",
      "codes": [
        "833"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "827"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "830",
        "841"
      ]
    },
    {
      "subject": "数电&半导体物理",
      "codes": []
    }
  ],
  "北京理工大学": [
    {
      "subject": "数模电",
      "codes": [
        "821"
      ]
    },
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "802",
        "816",
        "826"
      ]
    },
    {
      "subject": "信号&电磁场",
      "codes": []
    },
    {
      "subject": "模电&半导体物理",
      "codes": []
    }
  ],
  "哈尔滨工业大学": [
    {
      "subject": "数模电",
      "codes": [
        "826"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "803"
      ]
    }
  ],
  "兰州大学": [
    {
      "subject": "数模电",
      "codes": [
        "805"
      ]
    }
  ],
  "中国农业大学": [
    {
      "subject": "数模电",
      "codes": [
        "833"
      ]
    }
  ],
  "桂林电子科技大学": [
    {
      "subject": "数模电",
      "codes": [
        "817"
      ]
    },
    {
      "subject": "信号+「电路",
      "codes": [
        "806"
      ]
    }
  ],
  "北京林业大学": [
    {
      "subject": "数模电",
      "codes": [
        "808"
      ]
    }
  ],
  "广西大学": [
    {
      "subject": "数模电",
      "codes": [
        "824"
      ]
    },
    {
      "subject": "信号+「数电",
      "codes": [
        "816"
      ]
    }
  ],
  "江南大学": [
    {
      "subject": "数模电",
      "codes": [
        "810"
      ]
    }
  ],
  "郑州大学": [
    {
      "subject": "数模电",
      "codes": [
        "804",
        "816"
      ]
    },
    {
      "subject": "信号+「通信原理",
      "codes": [
        "829"
      ]
    }
  ],
  "东北师范大学": [
    {
      "subject": "数模电",
      "codes": [
        "857"
      ]
    }
  ],
  "南京师范大学": [
    {
      "subject": "数模电",
      "codes": [
        "856"
      ]
    }
  ],
  "石子河大学": [
    {
      "subject": "数模电",
      "codes": [
        "832"
      ]
    }
  ],
  "南方科技大学": [
    {
      "subject": "数模电",
      "codes": [
        "808",
        "817"
      ]
    }
  ],
  "佛山大学": [
    {
      "subject": "数模电",
      "codes": [
        "809"
      ]
    }
  ],
  "福建农林大学": [
    {
      "subject": "数模电",
      "codes": [
        "847"
      ]
    }
  ],
  "南华大学": [
    {
      "subject": "数模电",
      "codes": [
        "871"
      ]
    }
  ],
  "温州大学": [
    {
      "subject": "数模电",
      "codes": [
        "824"
      ]
    }
  ],
  "甘肃农业大学": [
    {
      "subject": "数模电",
      "codes": [
        "808"
      ]
    }
  ],
  "南宁师范大学": [
    {
      "subject": "数模电",
      "codes": [
        "808"
      ]
    }
  ],
  "西南科技大学": [
    {
      "subject": "数模电",
      "codes": [
        "811"
      ]
    }
  ],
  "上海电力大学": [
    {
      "subject": "数模电",
      "codes": [
        "851"
      ]
    }
  ],
  "深圳大学": [
    {
      "subject": "数模电",
      "codes": [
        "801"
      ]
    },
    {
      "subject": "信号+「通信原理",
      "codes": [
        "802"
      ]
    }
  ],
  "浙江师范大学": [
    {
      "subject": "数模电",
      "codes": [
        "822"
      ]
    }
  ],
  "天津职业技术师范大学": [
    {
      "subject": "数模电",
      "codes": [
        "806"
      ]
    }
  ],
  "重庆理工大学": [
    {
      "subject": "数模电",
      "codes": [
        "808"
      ]
    }
  ],
  "天水师范大学": [
    {
      "subject": "数模电",
      "codes": [
        "850"
      ]
    }
  ],
  "上海交通大学": [
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "819"
      ]
    },
    {
      "subject": "半导体物理&器件物理",
      "codes": []
    }
  ],
  "清华大学": [
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "801"
      ]
    },
    {
      "subject": "信号&电磁场",
      "codes": []
    },
    {
      "subject": "数电&模电&器件物理",
      "codes": []
    }
  ],
  "河海大学": [
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "863"
      ]
    }
  ],
  "华东理工大学": [
    {
      "subject": "信号+「数字信号处理",
      "codes": [
        "814"
      ]
    }
  ],
  "福建师范大学": [
    {
      "subject": "信号+「数电",
      "codes": [
        "834"
      ]
    },
    {
      "subject": "数电&模电&信号",
      "codes": []
    }
  ],
  "杭州师范大学": [
    {
      "subject": "信号+「数电",
      "codes": [
        "839"
      ]
    }
  ],
  "南京工业大学": [
    {
      "subject": "信号+「数电",
      "codes": [
        "817"
      ]
    }
  ],
  "扬州大学": [
    {
      "subject": "信号+「数电",
      "codes": [
        "875"
      ]
    }
  ],
  "浙江理工大学": [
    {
      "subject": "信号+「数电",
      "codes": [
        "847"
      ]
    }
  ],
  "大连海事大学": [
    {
      "subject": "信号+「电路",
      "codes": [
        "807"
      ]
    }
  ],
  "宁夏大学": [
    {
      "subject": "信号+「电路",
      "codes": [
        "820"
      ]
    }
  ],
  "山东科技大学": [
    {
      "subject": "信号+「电路",
      "codes": [
        "822",
        "825"
      ]
    }
  ],
  "中国矿业大学": [
    {
      "subject": "信号+「通信原理",
      "codes": [
        "824"
      ]
    },
    {
      "subject": "电路&电磁场",
      "codes": []
    }
  ],
  "内蒙古大学": [
    {
      "subject": "信号+「通信原理",
      "codes": [
        "869"
      ]
    }
  ],
  "浙江工业大学": [
    {
      "subject": "信号+「通信原理",
      "codes": [
        "830"
      ]
    }
  ],
  "【水木观畴】初试多门专业课组合，同类型选择较少的高校": [
    {
      "subject": "信号+「通信原理",
      "codes": []
    }
  ],
  "广西师范大学": [
    {
      "subject": "信号&模电",
      "codes": []
    }
  ],
  "南京工程学院": [
    {
      "subject": "信号&模电",
      "codes": []
    }
  ],
  "东北林业大学": [
    {
      "subject": "电路&模电",
      "codes": []
    }
  ],
  "北京航空航天大学": [
    {
      "subject": "数电、控制、光学三选二",
      "codes": []
    },
    {
      "subject": "数电&模电&器件物理",
      "codes": []
    },
    {
      "subject": "信号&模电&电磁场",
      "codes": []
    }
  ],
  "中国人民公安大学": [
    {
      "subject": "C语言&数电",
      "codes": []
    }
  ],
  "西北大学": [
    {
      "subject": "数电&模电&电路",
      "codes": []
    }
  ],
  "云南大学": [
    {
      "subject": "信号&数电&数处",
      "codes": []
    }
  ]
};